Tekla Open API Reference for Tekla Structures 2025
DimensionFormatAttributes Properties
The DimensionSetBaseAttributes.DimensionFormatAttributes type exposes the following members.
Properties
Name | Description
Format
 The format of the dimension.
Precision
 The precision of the dimension.
Unit
 Gets or sets the unit of the dimension. Changing this attribute does not have any effect if the dimension measures an angle.
UseDigitGrouping
 Gets or sets a value indicating whether digit grouping should be used or not.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
Tekla.Structures.Drawing Namespace